const SANSHIN = {
    男: {
        合: 0b00001000,
        乙: 0b00001001,
        老: 0b00001010,
        下老: 0b00001011
    },
    中: {
        四: 0b00010000,
        上: 0b00010001,
        中: 0b00010010,
        尺: 0b00010011,
        下尺: 0b00010100,
    },
    女: {
        工: 0b00100000,
        五: 0b00100001,
        六: 0b00100010,
        七: 0b00100011,
        八: 0b00100100,
        九: 0b00100101
    },
    PAUSE: 0,
    SHARP: 0b10000000,
    FLAT: 0b01000000,
    他: {
        〇: 0
    }
};

const KEY_NAME = {
    0: '〇',
    0b00001000: '合',
    0b00001001: '乙',
    0b00001010: '老',
    0b00001011: '下老',
    0b00010000: '四',
    0b00010001: '上',
    0b00010010: '中',
    0b00010011: '尺',
    0b00010100: '下尺',
    0b00100000: '工',
    0b00100001: '五',
    0b00100010: '六',
    0b00100011: '七',
    0b00100100: '八',
    0b00100101: '九',
    0b10000000: '♯',
    0b01000000: '♭'
};

const KEY_MAPPING = {
    QWERTY: {
        122: SANSHIN.男.合,
        120: SANSHIN.男.乙,
        99: SANSHIN.男.老,
        118: SANSHIN.男.下老,
        97: SANSHIN.中.四,
        115: SANSHIN.中.上,
        100: SANSHIN.中.中,
        102: SANSHIN.中.尺,
        103: SANSHIN.中.下尺,
        113: SANSHIN.女.工,
        119: SANSHIN.女.五,
        101: SANSHIN.女.六,
        114: SANSHIN.女.七,
        116: SANSHIN.女.八,
        121: SANSHIN.女.九,
        32: SANSHIN.PAUSE
    }
};